In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('50_Startups.csv')

In [3]:
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [4]:
df.isnull().mean()*100

R&D Spend          0.0
Administration     0.0
Marketing Spend    0.0
State              0.0
Profit             0.0
dtype: float64

In [5]:
ddf = df.sample(5)

In [32]:
ddf

    R&D Spend  Administration  Marketing Spend       State     Profit
9   123334.88       108679.17        304981.62  California  149759.96
0   165349.20       136897.80        471784.10    New York  192261.83
38   20229.59        65947.93        185265.10    New York   81229.06
24   77044.01        99281.34        140574.81    New York  108552.04
42   23640.93        96189.63        148001.11  California   71498.49

In [33]:

x = ddf.iloc[:, 0:-1]
y = ddf.iloc[:, -1]

In [34]:
x

    R&D Spend  Administration  Marketing Spend       State
9   123334.88       108679.17        304981.62  California
0   165349.20       136897.80        471784.10    New York
38   20229.59        65947.93        185265.10    New York
24   77044.01        99281.34        140574.81    New York
42   23640.93        96189.63        148001.11  California

In [35]:
x.iloc[0, 0] = np.nan
x.iloc[2, 1] = np.nan
x.iloc[3, 2] = np.nan

In [36]:
x

    R&D Spend  Administration  Marketing Spend       State
9         NaN       108679.17        304981.62  California
0   165349.20       136897.80        471784.10    New York
38   20229.59             NaN        185265.10    New York
24   77044.01        99281.34              NaN    New York
42   23640.93        96189.63        148001.11  California